0/Theta.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Theta.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

referenceLevel  0.0001;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-05;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            JohnsonJacksonParticleTheta;
        specularityCoefficient 0.5;
        restitutionCoefficient 0.8;
        value           uniform 0;
    }
}


// ************************************************************************* //
