0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            interstitialInletVelocity;
        inletVelocity   uniform ( 0 0 0.162 );
        alpha           alpha.air;
        value           uniform ( 0 0 0.162 );
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.air;
        value           uniform ( 0 0 0 );
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
