constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (particles air);

particles
{
    ThermoClassScheme	OpenSmokeThermoSolid;
    diameterModel	    polydisperseDiameter;
    constantCoeffs
    {
        d               125e-6;
    }

    alphaMax        	0.65;
    residualAlpha   	1e-6;
}

air
{
    ThermoClassScheme 	OpenSmokeThermoGas;
    diameterModel 	constant;
    constantCoeffs
    {
        d               1;
    }

    residualAlpha   	0;
}

blending
{
    default
    {
        type            none;
        continuousPhase air;
    }
}

sigma
(
    (particles and air) 0
);

aspectRatio
(
);

drag
(
    (particles in air)
    {
	type            LSD;
        residualRe      1e-5;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
);

heatTransfer
(
    (particles in air)
    {
        type            Gunn;
        residualAlpha   1e-3;
    }
);

massTransfer
(
    (particles in air)
    {
        type            massGunn;
        residualAlpha   1e-6;
    }
);

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
