constant/suOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

CAoptions
{
	tolerance	0.1;
	log		yes;
	pressure	no;
}

ISAToptions 
{

	Heterogeneous
	{
		// Basic parameters
		tolerance 				1e-6;		// ISAT tolerance [default: 1e-4]
		numberSubSteps				1;		// ISAT number of substeps for calculating gradient mapping [default: 1]
		numberSubTimeSteps			4;		//Number of Strang Cycle

		// Lists of useful leaves
		searchMRU				on;		    // search for MRU (Most Recently Used) leaves [default: on]
		searchMFU				on;		    // search for MFU (Most Frequently Used) leaves [default: on]
		searchBTSR				on;
		searchCL				off;
		maxSizeMRU 				100;		// max size of MRU (Most Recently Used) [default: 100]
		maxSizeMFU 				100; 		// max size of MFU (Most Frequently Used) [default: 100]
		maxSearchMRU 				10;		// max numbers of leaves to be tested (MRU) [default: 10]
		maxSearchMFU 				30;		// max numbers of leaves to be tested (MFU) [default: 30]

		// What to do when the tre is full?
		maxSizeBT 				100000;		// max size of binary tree [default: 100000]
		clearingIfFull 				on;             // if on the tree is cleared when full [default: off]
		
		// Balancing coefficients
		cleanAndBalance				on;		    // clean and balance [default: on]
		balanceFactor			    	50;		// number of events (add, grow, retrieve) * maxSizeBT between each cleaning procedure (set to have cleaning every 100-1000 time step)

		// This parameters influence how severe is the cleaning procedure
		maxTimeOldCoeff 			0.7;		// leaf used for the last time   [default: 0.7]
		maxGrowCoeff 				0.5;		// leaf grown more than maxGrowCoeff*maxSizeBT times [default: 0.5]
		minUsedCoeff 				0.01;		// leaf used less than minUsedCoeff*(nUse of last leaf in the MFU) [default: 0.01]
		maxHeightCoeff 				5.;		    // imbalance between the depth of each main branches of the tree (use value larger than 5) [default: 5.]

		// Factorizations
		luFactorization				"Partial";	// LU factorization of dense matrices (Partial || Full) [default: Partial]
		qrFactorization				"Full";		// QR factorization of dense matrices (NoPivoting || Partial || Full) [default: Full]

		// Scaling factors
		scalingFactors
		{
			T 				1.e4;
			others 			1.;		
		}

		// Absoute weights to scale the errors
		scalingErrors
		{
			T 				1.;
			others			1.;		
			mass			1.;
			gamma			1.;
		}
	}
}

// ************************************************************************* //


