system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
	nAlphaCorr      2;
        nAlphaSubCycles 2;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    5;

	smoothLimiter   0.1;

	implicitPhasePressure yes;
        solver          PBiCGStab;
        //smoother        DIC;
	preconditioner	DIC;
        tolerance       1e-7;
        relTol          1e-7;
	minIter         0;

/*
	nAlphaCorr      1;
        nAlphaSubCycles 2;

        smoothLimiter   0.1;

        implicitPhasePressure yes;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-6;
        minIter         1;
*/

/*
        nAlphaCorr      10;
        nAlphaSubCycles 5;

        smoothLimiter   0.1;

        implicitPhasePressure yes;
        solver          PBiCGStab; // smoothSolver;
        preconditioner	DIC;
	//smoother        DIC;
        tolerance       1e-12;
        relTol          0;
        minIter         1;
*/
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          1e-5;
	smoother	GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;
        relTol          0.1;
    }

    "Theta.*"
    {
        solver		PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          1e-6;
        minIter         0;
    }

    "(k|epsilon).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;
        relTol          0;
        minIter         1;
    }

    "(h|e).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    Yi1
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          1e-8;
    }

    Yi2
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          1e-8;
    }
}

PIMPLE
{
    nOuterCorrectors    4;
    nCorrectors         3;
    momentumPredictor	no;
    nNonOrthogonalCorrectors 0;
    faceMomentum	true;
}


// ************************************************************************* //
