system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    particles
);

boundaries
{
    inlet
    {
        type    fixedValue;
        value   uniform 0;
    }
    defaultFaces
    {
        type    empty;
    }
    walls
    {
        type    zeroGradient;
    }
    outlet
    {
        type    zeroGradient;
    }
}

particles
{
    type                alphaAndDiameter;
    weightDimension     [0 -3 0 0 0 0 0];
    abscissaDimension   [1 0 0 0 0 0 0];

    "internal|default"
    {
        node0
        {
            rho     uniform 1684;
            dia     uniform 125e-6;
            alpha   alpha.particles;
        }
    }

    setRegions
    {}
}


// ************************************************************************* //